MikroElektronika/core_packages/PIC/XC8/def/PIC16F1782/mcu.h
extern volatile SLRCONCbits_t SLRCONCbits __at(0x30E);
// bitfield macros
#define _SLRCONC_SLRCONC0_POSN                              0x0
#define _SLRCONC_SLRCONC0_POSITION                          0x0
#define _SLRCONC_SLRCONC0_SIZE                              0x1
#define _SLRCONC_SLRCONC0_LENGTH                            0x1
#define _SLRCONC_SLRCONC0_MASK                              0x1
#define _SLRCONC_SLRCONC1_POSN                              0x1
#define _SLRCONC_SLRCONC1_POSITION                          0x1
#define _SLRCONC_SLRCONC1_SIZE                              0x1
#define _SLRCONC_SLRCONC1_LENGTH                            0x1
#define _SLRCONC_SLRCONC1_MASK                              0x2
#define _SLRCONC_SLRCONC2_POSN                              0x2
#define _SLRCONC_SLRCONC2_POSITION                          0x2
#define _SLRCONC_SLRCONC2_SIZE                              0x1
#define _SLRCONC_SLRCONC2_LENGTH                            0x1
#define _SLRCONC_SLRCONC2_MASK                              0x4
#define _SLRCONC_SLRCONC3_POSN                              0x3
#define _SLRCONC_SLRCONC3_POSITION                          0x3
#define _SLRCONC_SLRCONC3_SIZE                              0x1
#define _SLRCONC_SLRCONC3_LENGTH                            0x1
#define _SLRCONC_SLRCONC3_MASK                              0x8
#define _SLRCONC_SLRCONC4_POSN                              0x4
#define _SLRCONC_SLRCONC4_POSITION                          0x4
#define _SLRCONC_SLRCONC4_SIZE                              0x1
#define _SLRCONC_SLRCONC4_LENGTH                            0x1
#define _SLRCONC_SLRCONC4_MASK                              0x10
#define _SLRCONC_SLRCONC5_POSN                              0x5
#define _SLRCONC_SLRCONC5_POSITION                          0x5
#define _SLRCONC_SLRCONC5_SIZE                              0x1
#define _SLRCONC_SLRCONC5_LENGTH                            0x1
#define _SLRCONC_SLRCONC5_MASK                              0x20
#define _SLRCONC_SLRCONC6_POSN                              0x6
#define _SLRCONC_SLRCONC6_POSITION                          0x6
#define _SLRCONC_SLRCONC6_SIZE                              0x1
#define _SLRCONC_SLRCONC6_LENGTH                            0x1
#define _SLRCONC_SLRCONC6_MASK                              0x40
#define _SLRCONC_SLRCONC7_POSN                              0x7
#define _SLRCONC_SLRCONC7_POSITION                          0x7
#define _SLRCONC_SLRCONC7_SIZE                              0x1
#define _SLRCONC_SLRCONC7_LENGTH                            0x1
#define _SLRCONC_SLRCONC7_MASK                              0x80
#define _SLRCONC_SLRCONC_POSN                               0x0
#define _SLRCONC_SLRCONC_POSITION                           0x0
#define _SLRCONC_SLRCONC_SIZE                               0x8
#define _SLRCONC_SLRCONC_LENGTH                             0x8
#define _SLRCONC_SLRCONC_MASK                               0xFF

// Register: INLVLA
#define INLVLA INLVLA
extern volatile unsigned char           INLVLA              __at(0x38C);
#ifndef _LIB_BUILD
asm("INLVLA equ 038Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLA0                :1;
        unsigned INLVLA1                :1;
        unsigned INLVLA2                :1;
        unsigned INLVLA3                :1;
        unsigned INLVLA4                :1;
        unsigned INLVLA5                :1;
        unsigned INLVLA6                :1;
        unsigned INLVLA7                :1;
    };
    struct {
        unsigned INLVLA                 :8;
    };
} INLVLAbits_t;
extern volatile INLVLAbits_t INLVLAbits __at(0x38C);
// bitfield macros
#define _INLVLA_INLVLA0_POSN                                0x0
#define _INLVLA_INLVLA0_POSITION                            0x0
#define _INLVLA_INLVLA0_SIZE                                0x1
#define _INLVLA_INLVLA0_LENGTH                              0x1
#define _INLVLA_INLVLA0_MASK                                0x1
#define _INLVLA_INLVLA1_POSN                                0x1
#define _INLVLA_INLVLA1_POSITION                            0x1
#define _INLVLA_INLVLA1_SIZE                                0x1
#define _INLVLA_INLVLA1_LENGTH                              0x1
#define _INLVLA_INLVLA1_MASK                                0x2
#define _INLVLA_INLVLA2_POSN                                0x2
#define _INLVLA_INLVLA2_POSITION                            0x2
#define _INLVLA_INLVLA2_SIZE                                0x1
#define _INLVLA_INLVLA2_LENGTH                              0x1
#define _INLVLA_INLVLA2_MASK                                0x4
#define _INLVLA_INLVLA3_POSN                                0x3
#define _INLVLA_INLVLA3_POSITION                            0x3
#define _INLVLA_INLVLA3_SIZE                                0x1
#define _INLVLA_INLVLA3_LENGTH                              0x1
#define _INLVLA_INLVLA3_MASK                                0x8
#define _INLVLA_INLVLA4_POSN                                0x4
#define _INLVLA_INLVLA4_POSITION                            0x4
#define _INLVLA_INLVLA4_SIZE                                0x1
#define _INLVLA_INLVLA4_LENGTH                              0x1
#define _INLVLA_INLVLA4_MASK                                0x10
#define _INLVLA_INLVLA5_POSN                                0x5
#define _INLVLA_INLVLA5_POSITION                            0x5
#define _INLVLA_INLVLA5_SIZE                                0x1
#define _INLVLA_INLVLA5_LENGTH                              0x1
#define _INLVLA_INLVLA5_MASK                                0x20
#define _INLVLA_INLVLA6_POSN                                0x6
#define _INLVLA_INLVLA6_POSITION                            0x6
#define _INLVLA_INLVLA6_SIZE                                0x1
#define _INLVLA_INLVLA6_LENGTH                              0x1
#define _INLVLA_INLVLA6_MASK                                0x40
#define _INLVLA_INLVLA7_POSN                                0x7
#define _INLVLA_INLVLA7_POSITION                            0x7
#define _INLVLA_INLVLA7_SIZE                                0x1
#define _INLVLA_INLVLA7_LENGTH                              0x1
#define _INLVLA_INLVLA7_MASK                                0x80
#define _INLVLA_INLVLA_POSN                                 0x0
#define _INLVLA_INLVLA_POSITION                             0x0
#define _INLVLA_INLVLA_SIZE                                 0x8
#define _INLVLA_INLVLA_LENGTH                               0x8
#define _INLVLA_INLVLA_MASK                                 0xFF

// Register: INLVLB
#define INLVLB INLVLB
extern volatile unsigned char           INLVLB              __at(0x38D);
#ifndef _LIB_BUILD
asm("INLVLB equ 038Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLB0                :1;
        unsigned INLVLB1                :1;
        unsigned INLVLB2                :1;
        unsigned INLVLB3                :1;
        unsigned INLVLB4                :1;
        unsigned INLVLB5                :1;
        unsigned INLVLB6                :1;
        unsigned INLVLB7                :1;
    };
    struct {
        unsigned INLVLB                 :8;
    };
} INLVLBbits_t;
extern volatile INLVLBbits_t INLVLBbits __at(0x38D);
// bitfield macros
#define _INLVLB_INLVLB0_POSN                                0x0
#define _INLVLB_INLVLB0_POSITION                            0x0
#define _INLVLB_INLVLB0_SIZE                                0x1
#define _INLVLB_INLVLB0_LENGTH                              0x1
#define _INLVLB_INLVLB0_MASK                                0x1
#define _INLVLB_INLVLB1_POSN                                0x1
#define _INLVLB_INLVLB1_POSITION                            0x1
#define _INLVLB_INLVLB1_SIZE                                0x1
#define _INLVLB_INLVLB1_LENGTH                              0x1
#define _INLVLB_INLVLB1_MASK                                0x2
#define _INLVLB_INLVLB2_POSN                                0x2
#define _INLVLB_INLVLB2_POSITION                            0x2
#define _INLVLB_INLVLB2_SIZE                                0x1
#define _INLVLB_INLVLB2_LENGTH                              0x1
#define _INLVLB_INLVLB2_MASK                                0x4
#define _INLVLB_INLVLB3_POSN                                0x3
#define _INLVLB_INLVLB3_POSITION                            0x3
#define _INLVLB_INLVLB3_SIZE                                0x1
#define _INLVLB_INLVLB3_LENGTH                              0x1
#define _INLVLB_INLVLB3_MASK                                0x8
#define _INLVLB_INLVLB4_POSN                                0x4
#define _INLVLB_INLVLB4_POSITION                            0x4
#define _INLVLB_INLVLB4_SIZE                                0x1
#define _INLVLB_INLVLB4_LENGTH                              0x1
#define _INLVLB_INLVLB4_MASK                                0x10
#define _INLVLB_INLVLB5_POSN                                0x5
#define _INLVLB_INLVLB5_POSITION                            0x5
#define _INLVLB_INLVLB5_SIZE                                0x1
#define _INLVLB_INLVLB5_LENGTH                              0x1
#define _INLVLB_INLVLB5_MASK                                0x20
#define _INLVLB_INLVLB6_POSN                                0x6
#define _INLVLB_INLVLB6_POSITION                            0x6
#define _INLVLB_INLVLB6_SIZE                                0x1
#define _INLVLB_INLVLB6_LENGTH                              0x1
#define _INLVLB_INLVLB6_MASK                                0x40
#define _INLVLB_INLVLB7_POSN                                0x7
#define _INLVLB_INLVLB7_POSITION                            0x7
#define _INLVLB_INLVLB7_SIZE                                0x1
#define _INLVLB_INLVLB7_LENGTH                              0x1
#define _INLVLB_INLVLB7_MASK                                0x80
#define _INLVLB_INLVLB_POSN                                 0x0
#define _INLVLB_INLVLB_POSITION                             0x0
#define _INLVLB_INLVLB_SIZE                                 0x8
#define _INLVLB_INLVLB_LENGTH                               0x8
#define _INLVLB_INLVLB_MASK                                 0xFF

