MikroElektronika/core_packages/PIC/XC8/def/PIC16F1782/mcu.h
extern volatile __bit                   PSMC2TMR0           __at(0x4238);	// @ (0x847 * 8 + 0)
#define                                 PSMC2TMR0_bit       _BIT_ACCESS(PSMC2TMRL,0)
// PSMC2TMRL<PSMC2TMR1>
extern volatile __bit                   PSMC2TMR1           __at(0x4239);	// @ (0x847 * 8 + 1)
#define                                 PSMC2TMR1_bit       _BIT_ACCESS(PSMC2TMRL,1)
// PSMC2TMRH<PSMC2TMR10>
extern volatile __bit                   PSMC2TMR10          __at(0x4242);	// @ (0x848 * 8 + 2)
#define                                 PSMC2TMR10_bit      _BIT_ACCESS(PSMC2TMRH,2)
// PSMC2TMRH<PSMC2TMR11>
extern volatile __bit                   PSMC2TMR11          __at(0x4243);	// @ (0x848 * 8 + 3)
#define                                 PSMC2TMR11_bit      _BIT_ACCESS(PSMC2TMRH,3)
// PSMC2TMRH<PSMC2TMR12>
extern volatile __bit                   PSMC2TMR12          __at(0x4244);	// @ (0x848 * 8 + 4)
#define                                 PSMC2TMR12_bit      _BIT_ACCESS(PSMC2TMRH,4)
// PSMC2TMRH<PSMC2TMR13>
extern volatile __bit                   PSMC2TMR13          __at(0x4245);	// @ (0x848 * 8 + 5)
#define                                 PSMC2TMR13_bit      _BIT_ACCESS(PSMC2TMRH,5)
// PSMC2TMRH<PSMC2TMR14>
extern volatile __bit                   PSMC2TMR14          __at(0x4246);	// @ (0x848 * 8 + 6)
#define                                 PSMC2TMR14_bit      _BIT_ACCESS(PSMC2TMRH,6)
// PSMC2TMRH<PSMC2TMR15>
extern volatile __bit                   PSMC2TMR15          __at(0x4247);	// @ (0x848 * 8 + 7)
#define                                 PSMC2TMR15_bit      _BIT_ACCESS(PSMC2TMRH,7)
// PSMC2TMRL<PSMC2TMR2>
extern volatile __bit                   PSMC2TMR2           __at(0x423A);	// @ (0x847 * 8 + 2)
#define                                 PSMC2TMR2_bit       _BIT_ACCESS(PSMC2TMRL,2)
// PSMC2TMRL<PSMC2TMR3>
extern volatile __bit                   PSMC2TMR3           __at(0x423B);	// @ (0x847 * 8 + 3)
#define                                 PSMC2TMR3_bit       _BIT_ACCESS(PSMC2TMRL,3)
// PSMC2TMRL<PSMC2TMR4>
extern volatile __bit                   PSMC2TMR4           __at(0x423C);	// @ (0x847 * 8 + 4)
#define                                 PSMC2TMR4_bit       _BIT_ACCESS(PSMC2TMRL,4)
// PSMC2TMRL<PSMC2TMR5>
extern volatile __bit                   PSMC2TMR5           __at(0x423D);	// @ (0x847 * 8 + 5)
#define                                 PSMC2TMR5_bit       _BIT_ACCESS(PSMC2TMRL,5)
// PSMC2TMRL<PSMC2TMR6>
extern volatile __bit                   PSMC2TMR6           __at(0x423E);	// @ (0x847 * 8 + 6)
#define                                 PSMC2TMR6_bit       _BIT_ACCESS(PSMC2TMRL,6)
// PSMC2TMRL<PSMC2TMR7>
extern volatile __bit                   PSMC2TMR7           __at(0x423F);	// @ (0x847 * 8 + 7)
#define                                 PSMC2TMR7_bit       _BIT_ACCESS(PSMC2TMRL,7)
// PSMC2TMRH<PSMC2TMR8>
extern volatile __bit                   PSMC2TMR8           __at(0x4240);	// @ (0x848 * 8 + 0)
#define                                 PSMC2TMR8_bit       _BIT_ACCESS(PSMC2TMRH,0)
// PSMC2TMRH<PSMC2TMR9>
extern volatile __bit                   PSMC2TMR9           __at(0x4241);	// @ (0x848 * 8 + 1)
#define                                 PSMC2TMR9_bit       _BIT_ACCESS(PSMC2TMRH,1)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x60);	// @ (0xC * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x61);	// @ (0xC * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x62);	// @ (0xC * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x63);	// @ (0xC * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x64);	// @ (0xC * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x65);	// @ (0xC * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x66);	// @ (0xC * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x67);	// @ (0xC * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x68);	// @ (0xD * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x69);	// @ (0xD * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x6A);	// @ (0xD * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x6B);	// @ (0xD * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x6C);	// @ (0xD * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x6D);	// @ (0xD * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x6E);	// @ (0xD * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x6F);	// @ (0xD * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x70);	// @ (0xE * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x71);	// @ (0xE * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x72);	// @ (0xE * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x73);	// @ (0xE * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x74);	// @ (0xE * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x75);	// @ (0xE * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x76);	// @ (0xE * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x77);	// @ (0xE * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// SSPCON2<RCEN>
extern volatile __bit                   RCEN                __at(0x10B3);	// @ (0x216 * 8 + 3)
#define                                 RCEN_bit            _BIT_ACCESS(SSPCON2,3)
// BAUD1CON<RCIDL>
extern volatile __bit                   RCIDL               __at(0xCFE);	// @ (0x19F * 8 + 6)
#define                                 RCIDL_bit           _BIT_ACCESS(BAUD1CON,6)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x48D);	// @ (0x91 * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x8D);	// @ (0x11 * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// EECON1<RD>
extern volatile __bit                   RD                  __at(0xCA8);	// @ (0x195 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(EECON1,0)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x83);	// @ (0x10 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// SSPCON2<RSEN>
extern volatile __bit                   RSEN                __at(0x10B1);	// @ (0x216 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSPCON2,1)
// RC1STA<RX9>
extern volatile __bit                   RX9                 __at(0xCEE);	// @ (0x19D * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RC1STA,6)
// RC1STA<RX9D>
extern volatile __bit                   RX9D                __at(0xCE8);	// @ (0x19D * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RC1STA,0)
// APFCON<RXSEL>
extern volatile __bit                   RXSEL               __at(0x8E9);	// @ (0x11D * 8 + 1)
#define                                 RXSEL_bit           _BIT_ACCESS(APFCON,1)
// SSPSTAT<R_nW>
extern volatile __bit                   R_nW                __at(0x10A2);	// @ (0x214 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSPSTAT,2)
// SSPCON3<SBCDE>
extern volatile __bit                   SBCDE               __at(0x10BA);	// @ (0x217 * 8 + 2)
#define                                 SBCDE_bit           _BIT_ACCESS(SSPCON3,2)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x8B7);	// @ (0x116 * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// SSPCON3<SCIE>
extern volatile __bit                   SCIE                __at(0x10BD);	// @ (0x217 * 8 + 5)
#define                                 SCIE_bit            _BIT_ACCESS(SSPCON3,5)
// BAUD1CON<SCKP>
extern volatile __bit                   SCKP                __at(0xCFC);	// @ (0x19F * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUD1CON,4)
// APFCON<SCKSEL>
extern volatile __bit                   SCKSEL              __at(0x8EC);	// @ (0x11D * 8 + 4)
#define                                 SCKSEL_bit          _BIT_ACCESS(APFCON,4)
// OSCCON<SCS0>
extern volatile __bit                   SCS0                __at(0x4C8);	// @ (0x99 * 8 + 0)
#define                                 SCS0_bit            _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS1>
extern volatile __bit                   SCS1                __at(0x4C9);	// @ (0x99 * 8 + 1)
#define                                 SCS1_bit            _BIT_ACCESS(OSCCON,1)
// SSPCON3<SDAHT>
extern volatile __bit                   SDAHT               __at(0x10BB);	// @ (0x217 * 8 + 3)
#define                                 SDAHT_bit           _BIT_ACCESS(SSPCON3,3)
// APFCON<SDISEL>
extern volatile __bit                   SDISEL              __at(0x8EB);	// @ (0x11D * 8 + 3)
#define                                 SDISEL_bit          _BIT_ACCESS(APFCON,3)
// APFCON<SDOSEL>
extern volatile __bit                   SDOSEL              __at(0x8ED);	// @ (0x11D * 8 + 5)
#define                                 SDOSEL_bit          _BIT_ACCESS(APFCON,5)
// SSPCON2<SEN>
extern volatile __bit                   SEN                 __at(0x10B0);	// @ (0x216 * 8 + 0)
#define                                 SEN_bit             _BIT_ACCESS(SSPCON2,0)
// TX1STA<SENDB>
extern volatile __bit                   SENDB               __at(0xCF3);	// @ (0x19E * 8 + 3)
#define                                 SENDB_bit           _BIT_ACCESS(TX1STA,3)
// SLRCONA<SLRCONA0>
extern volatile __bit                   SLRCONA0            __at(0x1860);	// @ (0x30C * 8 + 0)
#define                                 SLRCONA0_bit        _BIT_ACCESS(SLRCONA,0)
// SLRCONA<SLRCONA1>
extern volatile __bit                   SLRCONA1            __at(0x1861);	// @ (0x30C * 8 + 1)
#define                                 SLRCONA1_bit        _BIT_ACCESS(SLRCONA,1)
// SLRCONA<SLRCONA2>
extern volatile __bit                   SLRCONA2            __at(0x1862);	// @ (0x30C * 8 + 2)
#define                                 SLRCONA2_bit        _BIT_ACCESS(SLRCONA,2)
// SLRCONA<SLRCONA3>
extern volatile __bit                   SLRCONA3            __at(0x1863);	// @ (0x30C * 8 + 3)
#define                                 SLRCONA3_bit        _BIT_ACCESS(SLRCONA,3)
// SLRCONA<SLRCONA4>
extern volatile __bit                   SLRCONA4            __at(0x1864);	// @ (0x30C * 8 + 4)
#define                                 SLRCONA4_bit        _BIT_ACCESS(SLRCONA,4)
// SLRCONA<SLRCONA5>
extern volatile __bit                   SLRCONA5            __at(0x1865);	// @ (0x30C * 8 + 5)
#define                                 SLRCONA5_bit        _BIT_ACCESS(SLRCONA,5)
// SLRCONA<SLRCONA6>
extern volatile __bit                   SLRCONA6            __at(0x1866);	// @ (0x30C * 8 + 6)
#define                                 SLRCONA6_bit        _BIT_ACCESS(SLRCONA,6)
// SLRCONA<SLRCONA7>
extern volatile __bit                   SLRCONA7            __at(0x1867);	// @ (0x30C * 8 + 7)
#define                                 SLRCONA7_bit        _BIT_ACCESS(SLRCONA,7)
// SLRCONB<SLRCONB0>
extern volatile __bit                   SLRCONB0            __at(0x1868);	// @ (0x30D * 8 + 0)
#define                                 SLRCONB0_bit        _BIT_ACCESS(SLRCONB,0)
// SLRCONB<SLRCONB1>
extern volatile __bit                   SLRCONB1            __at(0x1869);	// @ (0x30D * 8 + 1)
#define                                 SLRCONB1_bit        _BIT_ACCESS(SLRCONB,1)
// SLRCONB<SLRCONB2>
extern volatile __bit                   SLRCONB2            __at(0x186A);	// @ (0x30D * 8 + 2)
#define                                 SLRCONB2_bit        _BIT_ACCESS(SLRCONB,2)
// SLRCONB<SLRCONB3>
extern volatile __bit                   SLRCONB3            __at(0x186B);	// @ (0x30D * 8 + 3)
#define                                 SLRCONB3_bit        _BIT_ACCESS(SLRCONB,3)
// SLRCONB<SLRCONB4>
extern volatile __bit                   SLRCONB4            __at(0x186C);	// @ (0x30D * 8 + 4)
#define                                 SLRCONB4_bit        _BIT_ACCESS(SLRCONB,4)
// SLRCONB<SLRCONB5>
extern volatile __bit                   SLRCONB5            __at(0x186D);	// @ (0x30D * 8 + 5)
#define                                 SLRCONB5_bit        _BIT_ACCESS(SLRCONB,5)
// SLRCONB<SLRCONB6>
extern volatile __bit                   SLRCONB6            __at(0x186E);	// @ (0x30D * 8 + 6)
#define                                 SLRCONB6_bit        _BIT_ACCESS(SLRCONB,6)
// SLRCONB<SLRCONB7>
extern volatile __bit                   SLRCONB7            __at(0x186F);	// @ (0x30D * 8 + 7)
#define                                 SLRCONB7_bit        _BIT_ACCESS(SLRCONB,7)
// SLRCONC<SLRCONC0>
extern volatile __bit                   SLRCONC0            __at(0x1870);	// @ (0x30E * 8 + 0)
#define                                 SLRCONC0_bit        _BIT_ACCESS(SLRCONC,0)
// SLRCONC<SLRCONC1>
extern volatile __bit                   SLRCONC1            __at(0x1871);	// @ (0x30E * 8 + 1)
#define                                 SLRCONC1_bit        _BIT_ACCESS(SLRCONC,1)
// SLRCONC<SLRCONC2>
extern volatile __bit                   SLRCONC2            __at(0x1872);	// @ (0x30E * 8 + 2)
#define                                 SLRCONC2_bit        _BIT_ACCESS(SLRCONC,2)
// SLRCONC<SLRCONC3>
extern volatile __bit                   SLRCONC3            __at(0x1873);	// @ (0x30E * 8 + 3)
#define                                 SLRCONC3_bit        _BIT_ACCESS(SLRCONC,3)
// SLRCONC<SLRCONC4>
extern volatile __bit                   SLRCONC4            __at(0x1874);	// @ (0x30E * 8 + 4)
#define                                 SLRCONC4_bit        _BIT_ACCESS(SLRCONC,4)
// SLRCONC<SLRCONC5>
extern volatile __bit                   SLRCONC5            __at(0x1875);	// @ (0x30E * 8 + 5)
#define                                 SLRCONC5_bit        _BIT_ACCESS(SLRCONC,5)
// SLRCONC<SLRCONC6>
extern volatile __bit                   SLRCONC6            __at(0x1876);	// @ (0x30E * 8 + 6)
#define                                 SLRCONC6_bit        _BIT_ACCESS(SLRCONC,6)
// SLRCONC<SLRCONC7>
extern volatile __bit                   SLRCONC7            __at(0x1877);	// @ (0x30E * 8 + 7)
#define                                 SLRCONC7_bit        _BIT_ACCESS(SLRCONC,7)
// SSPSTAT<SMP>
extern volatile __bit                   SMP                 __at(0x10A7);	// @ (0x214 * 8 + 7)
#define                                 SMP_bit             _BIT_ACCESS(SSPSTAT,7)
// RC1STA<SPEN>
extern volatile __bit                   SPEN                __at(0xCEF);	// @ (0x19D * 8 + 7)
#define                                 SPEN_bit            _BIT_ACCESS(RC1STA,7)
// OSCCON<SPLLEN>
extern volatile __bit                   SPLLEN              __at(0x4CF);	// @ (0x99 * 8 + 7)
#define                                 SPLLEN_bit          _BIT_ACCESS(OSCCON,7)
// RC1STA<SREN>
extern volatile __bit                   SREN                __at(0xCED);	// @ (0x19D * 8 + 5)
#define                                 SREN_bit            _BIT_ACCESS(RC1STA,5)
// PIE1<SSP1IE>
extern volatile __bit                   SSP1IE              __at(0x48B);	// @ (0x91 * 8 + 3)
#define                                 SSP1IE_bit          _BIT_ACCESS(PIE1,3)
// PIR1<SSP1IF>
extern volatile __bit                   SSP1IF              __at(0x8B);	// @ (0x11 * 8 + 3)
#define                                 SSP1IF_bit          _BIT_ACCESS(PIR1,3)
// SSPCON1<SSPEN>
extern volatile __bit                   SSPEN               __at(0x10AD);	// @ (0x215 * 8 + 5)
#define                                 SSPEN_bit           _BIT_ACCESS(SSPCON1,5)
// SSPCON1<SSPM0>
extern volatile __bit                   SSPM0               __at(0x10A8);	// @ (0x215 * 8 + 0)
#define                                 SSPM0_bit           _BIT_ACCESS(SSPCON1,0)
// SSPCON1<SSPM1>
extern volatile __bit                   SSPM1               __at(0x10A9);	// @ (0x215 * 8 + 1)
#define                                 SSPM1_bit           _BIT_ACCESS(SSPCON1,1)
// SSPCON1<SSPM2>
extern volatile __bit                   SSPM2               __at(0x10AA);	// @ (0x215 * 8 + 2)
#define                                 SSPM2_bit           _BIT_ACCESS(SSPCON1,2)
// SSPCON1<SSPM3>
extern volatile __bit                   SSPM3               __at(0x10AB);	// @ (0x215 * 8 + 3)
#define                                 SSPM3_bit           _BIT_ACCESS(SSPCON1,3)
// SSPCON1<SSPOV>
extern volatile __bit                   SSPOV               __at(0x10AE);	// @ (0x215 * 8 + 6)
#define                                 SSPOV_bit           _BIT_ACCESS(SSPCON1,6)
// PCON<STKOVF>
extern volatile __bit                   STKOVF              __at(0x4B7);	// @ (0x96 * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(PCON,7)
// PCON<STKUNF>
extern volatile __bit                   STKUNF              __at(0x4B6);	// @ (0x96 * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(PCON,6)
// WDTCON<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x4B8);	// @ (0x97 * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON,0)
// TX1STA<SYNC>
extern volatile __bit                   SYNC                __at(0xCF4);	// @ (0x19E * 8 + 4)
#define                                 SYNC_bit            _BIT_ACCESS(TX1STA,4)
// OPTION_REG<T0CS>
extern volatile __bit                   T0CS                __at(0x4AD);	// @ (0x95 * 8 + 5)
#define                                 T0CS_bit            _BIT_ACCESS(OPTION_REG,5)
// INTCON<T0IE>
extern volatile __bit                   T0IE                __at(0x5D);	// @ (0xB * 8 + 5)
#define                                 T0IE_bit            _BIT_ACCESS(INTCON,5)
// INTCON<T0IF>
extern volatile __bit                   T0IF                __at(0x5A);	// @ (0xB * 8 + 2)
#define                                 T0IF_bit            _BIT_ACCESS(INTCON,2)
// OPTION_REG<T0SE>
extern volatile __bit                   T0SE                __at(0x4AC);	// @ (0x95 * 8 + 4)
#define                                 T0SE_bit            _BIT_ACCESS(OPTION_REG,4)
// T1CON<T1CKPS0>
extern volatile __bit                   T1CKPS0             __at(0xC4);	// @ (0x18 * 8 + 4)
#define                                 T1CKPS0_bit         _BIT_ACCESS(T1CON,4)
// T1CON<T1CKPS1>
extern volatile __bit                   T1CKPS1             __at(0xC5);	// @ (0x18 * 8 + 5)
#define                                 T1CKPS1_bit         _BIT_ACCESS(T1CON,5)
// T1GCON<T1GGO>
extern volatile __bit                   T1GGO               __at(0xCB);	// @ (0x19 * 8 + 3)
#define                                 T1GGO_bit           _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GPOL>
extern volatile __bit                   T1GPOL              __at(0xCE);	// @ (0x19 * 8 + 6)
#define                                 T1GPOL_bit          _BIT_ACCESS(T1GCON,6)
// T1GCON<T1GSPM>
extern volatile __bit                   T1GSPM              __at(0xCC);	// @ (0x19 * 8 + 4)
#define                                 T1GSPM_bit          _BIT_ACCESS(T1GCON,4)
// T1GCON<T1GSS0>
extern volatile __bit                   T1GSS0              __at(0xC8);	// @ (0x19 * 8 + 0)
#define                                 T1GSS0_bit          _BIT_ACCESS(T1GCON,0)
// T1GCON<T1GSS1>
extern volatile __bit                   T1GSS1              __at(0xC9);	// @ (0x19 * 8 + 1)
#define                                 T1GSS1_bit          _BIT_ACCESS(T1GCON,1)
// T1GCON<T1GTM>
extern volatile __bit                   T1GTM               __at(0xCD);	// @ (0x19 * 8 + 5)
#define                                 T1GTM_bit           _BIT_ACCESS(T1GCON,5)
// T1GCON<T1GVAL>
extern volatile __bit                   T1GVAL              __at(0xCA);	// @ (0x19 * 8 + 2)
#define                                 T1GVAL_bit          _BIT_ACCESS(T1GCON,2)
// T1CON<T1OSCEN>
extern volatile __bit                   T1OSCEN             __at(0xC3);	// @ (0x18 * 8 + 3)
#define                                 T1OSCEN_bit         _BIT_ACCESS(T1CON,3)
// OSCSTAT<T1OSCR>
extern volatile __bit                   T1OSCR              __at(0x4D7);	// @ (0x9A * 8 + 7)
#define                                 T1OSCR_bit          _BIT_ACCESS(OSCSTAT,7)
// T2CON<T2CKPS0>
extern volatile __bit                   T2CKPS0             __at(0xE0);	// @ (0x1C * 8 + 0)
#define                                 T2CKPS0_bit         _BIT_ACCESS(T2CON,0)
// T2CON<T2CKPS1>
extern volatile __bit                   T2CKPS1             __at(0xE1);	// @ (0x1C * 8 + 1)
#define                                 T2CKPS1_bit         _BIT_ACCESS(T2CON,1)
// T2CON<T2OUTPS0>
extern volatile __bit                   T2OUTPS0            __at(0xE3);	// @ (0x1C * 8 + 3)
#define                                 T2OUTPS0_bit        _BIT_ACCESS(T2CON,3)
// T2CON<T2OUTPS1>
extern volatile __bit                   T2OUTPS1            __at(0xE4);	// @ (0x1C * 8 + 4)
#define                                 T2OUTPS1_bit        _BIT_ACCESS(T2CON,4)
// T2CON<T2OUTPS2>
extern volatile __bit                   T2OUTPS2            __at(0xE5);	// @ (0x1C * 8 + 5)
#define                                 T2OUTPS2_bit        _BIT_ACCESS(T2CON,5)
// T2CON<T2OUTPS3>
extern volatile __bit                   T2OUTPS3            __at(0xE6);	// @ (0x1C * 8 + 6)
